#გადარიცხვა
a = input("გთხოვთ აირჩიოთ რომელ ბანკში გნებავთ თანხის გადარიცხვა")
while a not in ["საქართველოს ბანკი","თიბისი ბანკი","ლიბერთი ბანკი"]:
    print("გთხოვთ აირჩიოთ ჩამოთვლილი ბაკებიდან ერთერთი:საქართელოს ბანკი, თიბისი ბანკი, ლიბერთი ბანკი")
    a = input("გთხოვთ აირჩიოთ რომელ ბანკში გნებავთ თანხის გადარიცხვა")
if a == ("საქართველოს ბანკი"):
        print("გთხოვთ აირჩიოთ გადასარიცხი თანხა,თუ თანხა ნაკლებია 10 000 -ზე გადარიცხვის საკომისიოა 7%,ხოლო 10 000 -ზე მეტ გადარიცხვაზე საკომისიოა 4%")
        c = int(input("რამდენის გადარიცხვა გსურთ"))
        if c <= 10000 :
            print("თქვენი გადასახელი თანხა იქნება" + str(c*1.07))
        else:
             
         if c  >= 10000 :
            print("თქვენი გადასახდელი თანხა იქნება" + str(c*1.04))

if a == ("თიბისი ბანკი"):
        print("გთხოვთ აირჩიოთ გადასარიცხი თანხა,თუ თანხა ნაკლებია 15 000 -ზე გადარიცხვის საკომისიოა 8% , ხოლო 15 000 -ზე მეტ გადარიცხვაზე საკომისიოა 3%  ")
        b = int(input("რამდენის გადარიცხვა გსურთ"))
        if b <= 15000:
            print("თქვენი გადასახდელი თანხა იქნება " + str(b*1.08))
        else:
            if b >= 15000:
                print("თქვენი გადასახდელი თანხა იქნება"+str(b*1.03))

if a == ("ლიბერთი ბანკი"):
    print("გთხოვთ აირჩიოთ გადასარიცხი თანხა,თუ თანხა ნაკლებია 20 000 -ზე გადარიცხვის საკომისიოა 5% , ხოლო 20 000 -ზე მეტ გადარიცხვაზე საკომისიოა 3% ")
    r = int(input("რამდენის გადარიცხვა გსურთ"))
if r <= 20000:
        print("თქვენი გადასახდელი თანხა იქნება"+str(r*1.05) )
else:
    if r >= 20000:
                print("თქვენი გადასახდელი თანხა იქნება "+str(r*1.03))

