def func (a,b):#ფუნქცია func-არგუმენტი a,b-პარამეტრი
    print(a+b)#აქ შეკრება 
func(1,2)
func(7,8)
func(1023,6412)
func(1111,2222)
func(511,115)
#აქ უკვე ფუნქციის გამოძახება
#ფუნქციას ვიყინებთ იმიტომ რომ ბევრი წერა არ მოგვიწიოს და გავამარტივოთ ჩვენი სამუშაო
#არსებოსბს მრავალი სახის ფუნქცია print(),def() და ასე შემდეგ
#არგუმენტი არის ის რითაც ფუნქციას ვიძახებთ ხოლო პარამეტრი არის რა მნიშვნელობასაც ვანიჭებთ გამოძახებულ ფუნქციას
#ფრჩხილები რათქმაუნდა სჭირდება ფუნქციას რათა არიყოს ერორი
#ერთიდაიგივე ფუნქცია მრავალჯერ შეიძლება გამოვიძახოთ არაერთი პარამეტრით და ასე შემდეეეგ