#2) შექმენით 4 სხვადასხვა ფუნქცია ერთი მიმატების მეორე გამოკლების მესამე გამრავლების მეოთხე გაყოფის,
#  თითოეულ ფუნქციაში უნდა მოხდეს შესაბამისი მოქმედება ორ რიცხვს შორის, მაგ. მეტობის ფუნქციაში უნად დაიბეჭდოს ნებისმიერი ორი რიცხვის ჯამი,
#  გამრავლების ფუნქციაში ნებისმიერი ორი რიცხვი ნამრავლი და ასე შემდეგ საბოლოოდ გამოიძხეთ ყველა ფუნქცია


def sum():
    print(2+3)

def minus():
    print(10-5)

def multiply():
    print(1*5)

def devide():
    print(10//2)

sum()
minus()
multiply()
devide()

